app/controllers/race_details_controller.rb

	def create
		race_detail = RaceDetail.new(params[:race_detail])
		if race_detail.save!
---
INSERT INTO "race_details" ("admin_id", "created_at", "event_city", "event_date", "event_name", "event_state", "race_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)